In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn

### csv file read

In [21]:
card_01 = pd.read_csv("df_card01.csv")
card_02 = pd.read_csv("df_card02.csv")
card_03 = pd.read_csv("df_card03.csv")
card_04 = pd.read_csv("df_card04.csv")
card_05 = pd.read_csv("df_card05.csv")
card_06 = pd.read_csv("df_card06.csv")

card_01.head()

,Unnamed: 0,receipt_dttm,adstrd_code,adstrd_nm,mrhst_induty_cl_code,mrhst_induty_cl_nm,selng_cascnt,salamt
0,0,20200104,11740,성내3동,70,약국,463,5843230.0
1,1,20200104,11740,성내3동,70,치과의원,33,7835550.0
2,2,20200104,11740,성내3동,70,한의원,53,4589800.0
3,3,20200104,11740,성내3동,70,의원,339,9267240.0
4,4,20200104,11740,성내3동,61,자동차정비,19,4441000.0

In [22]:
card = pd.concat([card_01, card_02, card_03, card_04, card_05, card_06])
card.tail()

,Unnamed: 0,receipt_dttm,adstrd_code,adstrd_nm,mrhst_induty_cl_code,mrhst_induty_cl_nm,selng_cascnt,salamt
380409,380409,20200614,11215,구의2동,40,대형할인점,136.0,1195640.0
380410,380410,20200614,11215,자양4동,90,인테 리어,2.0,13100.0
380411,380411,20200614,11620,보라매동,61,주 차 장,2.0,14500.0
380412,380412,20200614,11350,월계1동,99,기타전문점,1.0,38000.0
380413,380413,20200614,11590,흑석동,92,사무통신기기수리,1.0,20000.0

In [23]:
card['mrhst_induty_cl_code'].value_counts()
code = []
for i in card['mrhst_induty_cl_code'].value_counts().index:
    code.append(i)
code.sort()
print("코드: ", code, "\n코드 개수: ", len(code))

코드:  [10, 11, 20, 21, 22, 30, 31, 32, 33, 34, 40, 41, 42, 43, 44, 50, 51, 52, 60, 61, 62, 70, 71, 80, 81, 82, 83, 84, 90, 91, 92, 93, 95, 96, 99]
코드 개수:  35

In [24]:
count = card['receipt_dttm'].value_counts().index
day = []
for i in count:
    day.append(i)
day.sort()
day[0], len(day)

(20200104, 155)

#### 지역 6개 선정
서초구 : 11650 <br>
용산구 : 11170 <br>

#### DataFrame 구 별로 세팅

In [25]:
is_code_ys = card['adstrd_code'] == 11170
YS = card[is_code_ys]
YS.head()

,Unnamed: 0,receipt_dttm,adstrd_code,adstrd_nm,mrhst_induty_cl_code,mrhst_induty_cl_nm,selng_cascnt,salamt
7868,7868,20200104,11170,보광동,83,기타음료식품,52.0,447880.0
7869,7869,20200104,11170,보광동,83,농축수산품,36.0,799000.0
7870,7870,20200104,11170,보광동,83,제과점,71.0,657080.0
7871,7871,20200104,11170,보광동,80,스넥,106.0,1729600.0
7872,7872,20200104,11170,보광동,80,주점,14.0,671500.0

In [55]:
is_date = is_code_ys = card['receipt_dttm'] > 20200229
YS03 = card[is_date]
count = YS03['receipt_dttm'].value_counts().index
day03 = []
for i in count:
    day03.append(i)
day03.sort()
print(len(day03))

first_day = []
for i in range(0, 106):
    if(i%7==0):
        first_day.append(day03[i])
print(first_day, "\n", len(first_day))

106
[20200301, 20200308, 20200315, 20200322, 20200329, 20200405, 20200412, 20200419, 20200426, 20200503, 20200510, 20200517, 20200524, 20200531, 20200607, 20200614]
 16

In [56]:
ys_group = YS03.groupby(['receipt_dttm','mrhst_induty_cl_code'],as_index=False).selng_cascnt.sum()
ys_group.tail()

      receipt_dttm  mrhst_induty_cl_code  selng_cascnt
3698      20200614                    91       51025.0
3699      20200614                    92       12537.0
3700      20200614                    93        4642.0
3701      20200614                    96          87.0
3702      20200614                    99     4840828.0

In [59]:
# test_code

#is_day = (ys_group['receipt_dttm']>=first_day[0]) & (ys_group['receipt_dttm'] < first_day[1])
#ys_week = ys_group[is_day]
#print(ys_week)
#ys_week = ys_week.groupby(['mrhst_induty_cl_code'],as_index=False).selng_cascnt.sum()
#ys_week

In [77]:
total_sum = []

for i in range(0, 15):
    is_day = (ys_group['receipt_dttm']>=first_day[i]) & (ys_group['receipt_dttm'] < first_day[i+1])
    ys_week = ys_group[is_day]
    ys_week = ys_week.groupby(['mrhst_induty_cl_code'],as_index=False).selng_cascnt.sum()
    total_sum.append(ys_week)
    
total_sum[0].head()

   mrhst_induty_cl_code  selng_cascnt
0                    10       50301.0
1                    11     2423499.0
2                    20       40306.0
3                    21      452185.0
4                    22       67988.0

In [78]:
total_mean = []
for i in total_sum:
    i['selng_cascnt'] = i['selng_cascnt'].apply(lambda x: x/7)
    total_mean.append(i)

In [94]:
total_mean[0].head()

   mrhst_induty_cl_code   selng_cascnt
0                    10    7185.857143
1                    11  346214.142857
2                    20    5758.000000
3                    21   64597.857143
4                    22    9712.571429

#### 용산구 평균값

In [70]:
is_day = YS['receipt_dttm'] <= 20200229
ys_mean = YS[is_day]
ys_mean.tail()

,Unnamed: 0,receipt_dttm,adstrd_code,adstrd_nm,mrhst_induty_cl_code,mrhst_induty_cl_nm,selng_cascnt,salamt
552851,552851,20200229,11170,용문동,71,화 장 품,1.0,35000.0
552937,552937,20200229,11170,이태원1동,71,이 용 원,1.0,35000.0
552972,552972,20200229,11170,남영동,91,이동통신요금,169.0,9741328.0
553009,553009,20200229,11170,용산2가동,42,기타의류,4.0,52400.0
553016,553016,20200229,11170,남영동,21,헬스 크럽,2.0,646500.0

In [71]:
count0102 = ys_mean['receipt_dttm'].value_counts().index
day0102 = []
for i in count0102:
    day0102.append(i)
day0102.sort()
day0102[0], len(day0102)

(20200104, 49)

In [73]:
ys_mean = ys_mean.groupby(['mrhst_induty_cl_code'], as_index = False).selng_cascnt.sum()
ys_mean.head()

   mrhst_induty_cl_code  selng_cascnt
0                    10       15318.0
1                    11         868.0
2                    20        9218.0
3                    21       49894.0
4                    22      208283.0

In [74]:
ys_mean['selng_cascnt'] = ys_mean['selng_cascnt'].apply(lambda x:x/len(day0102))

In [93]:
ys_mean.head()  # 1, 2월에 업종코드 95가 없음.

   mrhst_induty_cl_code  selng_cascnt
0                    10    312.612245
1                    11     17.714286
2                    20    188.122449
3                    21   1018.244898
4                    22   4250.673469

#### 용산구 상대값 계산

상대값 = {(주차 평균) - (1, 2월 평균)}/(1, 2월 평균) * 100

In [80]:
len(total_mean) # 3월부터 6월까지 총 15주 존재

15

In [115]:
total_mean[0].tail()

    mrhst_induty_cl_code   selng_cascnt
30                    92    7803.428571
31                    93    4101.285714
32                    95   21233.285714
33                    96      64.857143
34                    99  309692.285714

In [116]:
re_total_mean = []
num = 0
for i in total_mean:
    i = i.drop([32, 33, 34]) # 32번째 열은 업종코드 95
    i = i.append({'mrhst_induty_cl_code' : total_mean[num]['mrhst_induty_cl_code'][33], 'selng_cascnt' : total_mean[num]['selng_cascnt'][33]}, ignore_index = True)
    i = i.append({'mrhst_induty_cl_code' : total_mean[num]['mrhst_induty_cl_code'][34], 'selng_cascnt' : total_mean[num]['selng_cascnt'][34]}, ignore_index = True)
    re_total_mean.append(i)
    num = num+1
re_total_mean[0].tail()

    mrhst_induty_cl_code   selng_cascnt
29                  91.0   56490.571429
30                  92.0    7803.428571
31                  93.0    4101.285714
32                  96.0      64.857143
33                  99.0  309692.285714

In [123]:
re_total_mean[0].head()

   mrhst_induty_cl_code   selng_cascnt
0                  10.0    7185.857143
1                  11.0  346214.142857
2                  20.0    5758.000000
3                  21.0   64597.857143
4                  22.0    9712.571429

In [124]:
per1 = []
ys_per = []

for i in re_total_mean:
    per1 = []
    for j in range(0, 34):
        a = i['selng_cascnt'][j]
        b = ys_mean['selng_cascnt'][j]
        per = (a - b)/b*100
        per1.append(per)
    ys_per.append(per1)
ys_per[1], len(ys_per[1])

([2389.163076119598,
  2098671.7741935486,
  3592.2000433933604,
  6174.409748667174,
  133.83185377587225,
  6837.067773167358,
  3992.4005865608556,
  19864.630225080386,
  10413.944641873968,
  2771.186440677966,
  682.773916740318,
  98.78260787228604,
  4400.75211532435,
  40708.333333333336,
  6624.649523952321,
  6074.047570016474,
  4947.773571299802,
  888.1913622396721,
  6663.149078726969,
  7613.381302690222,
  2658.6577405060275,
  5624.569348968864,
  3470.663738896097,
  2371.0699757325356,
  938.0854136579327,
  972.7610553697509,
  1547.22343863252,
  2977.900912646675,
  3823.8247600295344,
  1825.166136061571,
  5895.541308465686,
  9566.635987114589,
  142933.3333333333,
  228956.68653158526],
 34)